import { StyledCover } from './styles'

export const Cover = () => {
  return (
    <StyledCover>
      <h1>
        안녕하세요
        <br />
        노우현입니다.
      </h1>
      <p>
        4년 차 웹 프론트엔드 개발자 노우현입니다. 초기에는 디자인과 개발을 모두
        도맡아 프로젝트를 진행했지만, 현재는 프론트엔드 개발에 집중하여 커리어를
        쌓아나가고 있습니다.
      </p>
      <p>
        견고하게 설계된 사용자 경험과 유려한 인터페이스는 프로덕트에 대한
        긍정적인 인상을 남기는 데 중요한 역할을 한다고 믿습니다. UI/UX의
        디테일을 살리는 데 집중하며 디자인 시스템 설계와 같이 생산성 향상을 위한
        기반을 설계하는 것에 관심 있습니다.
      </p>
    </StyledCover>
  )
}
